app/controllers/rentals_controller.rb

INSERT INTO "users" ("created_at", "email", "encrypted_password", "updated_at") VALUES (?, ?, ?, ?)
SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", "1"]]
---
  def create
    # initialize marketplace

    marketplace = Balanced::Marketplace.my_marketplace

    # user represents a user in our database who wants to rent a bicycle
    # buyer is a Balanced::Customer object that knows about payment information for user
    # or guest who wants to rent a bicycle

    buyer, user = nil, nil

    # logic to handle guest/not signed in users

    if user_signed_in?
      buyer = current_user.balanced_customer
    else
      buyer = User.create_balanced_customer(
        :name  => params[:"guest-name"],
        :email => params[:"guest-email_address"]
        )
    end

    listing = Listing.find(params[:listing_id])